Revit 2026 API

# FilePath Constructor

---

Constructs a FilePath

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilePath(
	string path
)
```
```vb
Public Sub New (
	path As String
)
```
```cpp
public:
FilePath(
	String^ path
)
```
```fsharp
new :
        path : string -> FilePath
```

#### Parameters

path String
     The path to the file. This path does not have to be a full path; it can be relative.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FilePath Class

Autodesk.Revit.DB Namespace